import os

# Для локального запуска
try:
    from dotenv import load_dotenv
    load_dotenv()
    print("✅ Файл .env загружен")
except:
    print("⚠️ Файл .env не найден, используем переменные окружения")

# Ключевые параметры системы
TOKEN = os.environ.get('BOT_TOKEN', '')
ADMIN_ID = int(os.environ.get('ADMIN_ID', 0))

# Проверка конфигурации
def check_config():
    print("\n" + "="*50)
    print("🕵️‍♂️ ПРОВЕРКА КОНФИГУРАЦИИ СИСТЕМЫ")
    print("="*50)
    
    if not TOKEN:
        print("""
❌ КРИТИЧЕСКАЯ ОШИБКА: BOT_TOKEN не установлен!

Действия:
1. Откройте @BotFather в Telegram
2. Создайте нового бота: /newbot
3. Название: Кладовая улик
4. Username: secret_evidence_bot
5. Скопируйте токен (пример: 6123456789:AAHdqTcvCH1vGWJ...)

6. Создайте файл .env в папке проекта:
BOT_TOKEN=ваш_токен_здесь
ADMIN_ID=ваш_id_здесь

Или установите переменные окружения:
export BOT_TOKEN=ваш_токен
export ADMIN_ID=ваш_id
        """)
        return False
    
    if not ADMIN_ID:
        print("""
⚠️ ПРЕДУПРЕЖДЕНИЕ: ADMIN_ID не установлен

Как узнать свой ID:
1. Откройте @userinfobot в Telegram
2. Нажмите /start
3. Скопируйте 'Id: 123456789'

Добавьте в .env:
ADMIN_ID=ваш_id_здесь
        """)
        return False
    
    print(f"""
✅ КОНФИГУРАЦИЯ ПРОВЕРЕНА:
• Система: Кладовая улик
• Хранитель ID: {ADMIN_ID}
• Токен безопасности: {'установлен' if TOKEN else 'ОШИБКА'}
• База данных: evidence_locker.db
    """)
    return True

if __name__ == '__main__':
    check_config()
